; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v13 ?v9)
             (pred_3 ?v3 ?v8)
             (pred_4 ?v13 ?v8)
             (pred_6 ?v12 ?v13 )
	     (pred_5 ?v13)
             (pred_2 ?v11)
             (pred_12 ?v3)
             (pred_7 ?v8)
             (pred_8 ?v13)
             (pred_1 ?v3)
             (pred_11 ?v13)
             (pred_9 ))



(:action op_4
:parameters (?v1 ?v7 ?v2 ?v6)
:precondition (and (pred_2 ?v1) (pred_2 ?v7) (pred_12 ?v2) (pred_7 ?v6)
          (pred_10 ?v1 ?v7) (pred_3 ?v2 ?v6)
                   (pred_4 ?v7 ?v6) (pred_5 ?v1) 
                   (pred_8 ?v7) (pred_1 ?v2))
:effect (and  (pred_11 ?v7) (not (pred_8 ?v7))))


(:action op_1
:parameters (?v1 ?v4)
:precondition (and (pred_2 ?v1) (pred_2 ?v4)
               (pred_5 ?v1) (pred_10 ?v1 ?v4) (pred_11 ?v4))
:effect (and (pred_5 ?v4) (not (pred_5 ?v1))))

(:action op_3
:parameters (?v1 ?v2)
:precondition (and (pred_2 ?v1) (pred_12 ?v2) 
                  (pred_5 ?v1) (pred_6 ?v2 ?v1) (pred_9 ))
:effect (and (pred_1 ?v2)
   (not (pred_6 ?v2 ?v1)) (not (pred_9 ))))


(:action op_2
:parameters (?v1 ?v5 ?v10)
:precondition (and (pred_2 ?v1) (pred_12 ?v5) (pred_12 ?v10)
                  (pred_5 ?v1) (pred_1 ?v10) (pred_6 ?v5 ?v1))
:effect (and (pred_1 ?v5) (pred_6 ?v10 ?v1)
        (not (pred_1 ?v10)) (not (pred_6 ?v5 ?v1))))

(:action op_5
:parameters (?v1 ?v2)
:precondition (and (pred_2 ?v1) (pred_12 ?v2) 
                  (pred_5 ?v1) (pred_1 ?v2))
:effect (and (pred_9 ) (pred_6 ?v2 ?v1) (not (pred_1 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_16 obj_03 obj_15 obj_18 obj_19 obj_21 obj_13 obj_09 obj_12 obj_04 obj_20 obj_05 obj_08 obj_02 obj_07
    obj_11 obj_06 obj_01
    obj_10 obj_17 obj_14
    )

    (:init
       (pred_9)

       (pred_2 obj_22)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_2 obj_15)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_21)
       (pred_2 obj_13)
       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_20)
       (pred_2 obj_05)
       (pred_2 obj_08)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_7 obj_11)
       (pred_7 obj_06)
       (pred_7 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_14)

       (pred_10 obj_22 obj_18)
       (pred_10 obj_22 obj_16)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_03)
       (pred_10 obj_16 obj_22)
       (pred_10 obj_03 obj_21)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_18 obj_22)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_18)
       (pred_10 obj_21 obj_04)
       (pred_10 obj_21 obj_13)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_13 obj_21)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_04 obj_21)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_02 obj_04)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_02)
       (pred_8 obj_02)
       (pred_8 obj_05)
       (pred_8 obj_21)
       (pred_4  obj_02 obj_11)
       (pred_4  obj_05 obj_06)
       (pred_4  obj_21 obj_01)
       (pred_11 obj_22)
       (pred_11 obj_16)
       (pred_11 obj_03)
       (pred_11 obj_15)
       (pred_11 obj_18)
       (pred_11 obj_19)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_08)
       (pred_11 obj_07)

       (pred_3  obj_10 obj_11)
       (pred_3  obj_17 obj_06)
       (pred_3  obj_14 obj_01)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_14 obj_20)
       (pred_5 obj_19)
    )

    (:goal (and
       (pred_6 obj_10 obj_15)
       (pred_6 obj_14 obj_08)
    ))
(:constraints
  (always (not (pred_5 obj_04)))
)
)

; plan
1. (op_1 obj_19 obj_18)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_18)
   goals met: 0 of 2
2. (op_3 obj_18 obj_10)
   deleted: (pred_6 obj_10 obj_18) (pred_9)
   added: (pred_1 obj_10)
   goals met: 0 of 2
3. (op_1 obj_18 obj_19)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_19)
   goals met: 0 of 2
4. (op_1 obj_19 obj_12)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_12)
   goals met: 0 of 2
5. (op_1 obj_12 obj_08)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_08)
   goals met: 0 of 2
6. (op_4 obj_08 obj_02 obj_10 obj_11)
   deleted: (pred_8 obj_02)
   added: (pred_11 obj_02)
   goals met: 0 of 2
7. (op_1 obj_08 obj_02)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_02)
   goals met: 0 of 2
8. (op_1 obj_02 obj_07)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_07)
   goals met: 0 of 2
9. (op_1 obj_07 obj_20)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_20)
   goals met: 0 of 2
10. (op_1 obj_20 obj_13)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_13)
   goals met: 0 of 2
11. (op_1 obj_13 obj_15)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_15)
   goals met: 0 of 2
12. (op_5 obj_15 obj_10)
   deleted: (pred_1 obj_10)
   added: (pred_9) (pred_6 obj_10 obj_15)
   goals met: 1 of 2
13. (op_1 obj_15 obj_13)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_13)
   goals met: 1 of 2
14. (op_1 obj_13 obj_20)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_20)
   goals met: 1 of 2
15. (op_3 obj_20 obj_14)
   deleted: (pred_6 obj_14 obj_20) (pred_9)
   added: (pred_1 obj_14)
   goals met: 1 of 2
16. (op_1 obj_20 obj_07)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_07)
   goals met: 1 of 2
17. (op_1 obj_07 obj_02)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_02)
   goals met: 1 of 2
18. (op_1 obj_02 obj_08)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_08)
   goals met: 1 of 2
19. (op_5 obj_08 obj_14)
   deleted: (pred_1 obj_14)
   added: (pred_9) (pred_6 obj_14 obj_08)
   goals met: 2 of 2
